# FabricationPartNotAttachedToStraight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartNotAttachedToStraight Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The part must be attached to straight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartNotAttachedToStraight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartNotAttachedToStraight As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartNotAttachedToStraight {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace